grevaillot/svd_tools/headers/ATSAM3X8H/pioa.h
/** @defgroup pioa_ifer IFER Glitch Input Filter Enable Register
@{*/

/** PIOA_IFER_P31 Input Filter Enable **/
#define PIOA_IFER_P31		(1 << 31)
/** PIOA_IFER_P30 Input Filter Enable **/
#define PIOA_IFER_P30		(1 << 30)
/** PIOA_IFER_P29 Input Filter Enable **/
#define PIOA_IFER_P29		(1 << 29)
/** PIOA_IFER_P28 Input Filter Enable **/
#define PIOA_IFER_P28		(1 << 28)
/** PIOA_IFER_P27 Input Filter Enable **/
#define PIOA_IFER_P27		(1 << 27)
/** PIOA_IFER_P26 Input Filter Enable **/
#define PIOA_IFER_P26		(1 << 26)
/** PIOA_IFER_P25 Input Filter Enable **/
#define PIOA_IFER_P25		(1 << 25)
/** PIOA_IFER_P24 Input Filter Enable **/
#define PIOA_IFER_P24		(1 << 24)
/** PIOA_IFER_P23 Input Filter Enable **/
#define PIOA_IFER_P23		(1 << 23)
/** PIOA_IFER_P22 Input Filter Enable **/
#define PIOA_IFER_P22		(1 << 22)
/** PIOA_IFER_P21 Input Filter Enable **/
#define PIOA_IFER_P21		(1 << 21)
/** PIOA_IFER_P20 Input Filter Enable **/
#define PIOA_IFER_P20		(1 << 20)
/** PIOA_IFER_P19 Input Filter Enable **/
#define PIOA_IFER_P19		(1 << 19)
/** PIOA_IFER_P18 Input Filter Enable **/
#define PIOA_IFER_P18		(1 << 18)
/** PIOA_IFER_P17 Input Filter Enable **/
#define PIOA_IFER_P17		(1 << 17)
/** PIOA_IFER_P16 Input Filter Enable **/
#define PIOA_IFER_P16		(1 << 16)
/** PIOA_IFER_P15 Input Filter Enable **/
#define PIOA_IFER_P15		(1 << 15)
/** PIOA_IFER_P14 Input Filter Enable **/
#define PIOA_IFER_P14		(1 << 14)
/** PIOA_IFER_P13 Input Filter Enable **/
#define PIOA_IFER_P13		(1 << 13)
/** PIOA_IFER_P12 Input Filter Enable **/
#define PIOA_IFER_P12		(1 << 12)
/** PIOA_IFER_P11 Input Filter Enable **/
#define PIOA_IFER_P11		(1 << 11)
/** PIOA_IFER_P10 Input Filter Enable **/
#define PIOA_IFER_P10		(1 << 10)
/** PIOA_IFER_P9 Input Filter Enable **/
#define PIOA_IFER_P9		(1 << 9)
/** PIOA_IFER_P8 Input Filter Enable **/
#define PIOA_IFER_P8		(1 << 8)
/** PIOA_IFER_P7 Input Filter Enable **/
#define PIOA_IFER_P7		(1 << 7)
/** PIOA_IFER_P6 Input Filter Enable **/
#define PIOA_IFER_P6		(1 << 6)
/** PIOA_IFER_P5 Input Filter Enable **/
#define PIOA_IFER_P5		(1 << 5)
/** PIOA_IFER_P4 Input Filter Enable **/
#define PIOA_IFER_P4		(1 << 4)
/** PIOA_IFER_P3 Input Filter Enable **/
#define PIOA_IFER_P3		(1 << 3)
/** PIOA_IFER_P2 Input Filter Enable **/
#define PIOA_IFER_P2		(1 << 2)
/** PIOA_IFER_P1 Input Filter Enable **/
#define PIOA_IFER_P1		(1 << 1)
/** PIOA_IFER_P0 Input Filter Enable **/
#define PIOA_IFER_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_ifdr IFDR Glitch Input Filter Disable Register
@{*/

/** PIOA_IFDR_P31 Input Filter Disable **/
#define PIOA_IFDR_P31		(1 << 31)
/** PIOA_IFDR_P30 Input Filter Disable **/
#define PIOA_IFDR_P30		(1 << 30)
/** PIOA_IFDR_P29 Input Filter Disable **/
#define PIOA_IFDR_P29		(1 << 29)
/** PIOA_IFDR_P28 Input Filter Disable **/
#define PIOA_IFDR_P28		(1 << 28)
/** PIOA_IFDR_P27 Input Filter Disable **/
#define PIOA_IFDR_P27		(1 << 27)
/** PIOA_IFDR_P26 Input Filter Disable **/
#define PIOA_IFDR_P26		(1 << 26)
/** PIOA_IFDR_P25 Input Filter Disable **/
#define PIOA_IFDR_P25		(1 << 25)
/** PIOA_IFDR_P24 Input Filter Disable **/
#define PIOA_IFDR_P24		(1 << 24)
/** PIOA_IFDR_P23 Input Filter Disable **/
#define PIOA_IFDR_P23		(1 << 23)
/** PIOA_IFDR_P22 Input Filter Disable **/
#define PIOA_IFDR_P22		(1 << 22)
/** PIOA_IFDR_P21 Input Filter Disable **/
#define PIOA_IFDR_P21		(1 << 21)
/** PIOA_IFDR_P20 Input Filter Disable **/
#define PIOA_IFDR_P20		(1 << 20)
/** PIOA_IFDR_P19 Input Filter Disable **/
#define PIOA_IFDR_P19		(1 << 19)
/** PIOA_IFDR_P18 Input Filter Disable **/
#define PIOA_IFDR_P18		(1 << 18)
/** PIOA_IFDR_P17 Input Filter Disable **/
#define PIOA_IFDR_P17		(1 << 17)
/** PIOA_IFDR_P16 Input Filter Disable **/
#define PIOA_IFDR_P16		(1 << 16)
/** PIOA_IFDR_P15 Input Filter Disable **/
#define PIOA_IFDR_P15		(1 << 15)
/** PIOA_IFDR_P14 Input Filter Disable **/
#define PIOA_IFDR_P14		(1 << 14)
/** PIOA_IFDR_P13 Input Filter Disable **/
#define PIOA_IFDR_P13		(1 << 13)
/** PIOA_IFDR_P12 Input Filter Disable **/
#define PIOA_IFDR_P12		(1 << 12)
/** PIOA_IFDR_P11 Input Filter Disable **/
#define PIOA_IFDR_P11		(1 << 11)
/** PIOA_IFDR_P10 Input Filter Disable **/
#define PIOA_IFDR_P10		(1 << 10)
/** PIOA_IFDR_P9 Input Filter Disable **/
#define PIOA_IFDR_P9		(1 << 9)
/** PIOA_IFDR_P8 Input Filter Disable **/
#define PIOA_IFDR_P8		(1 << 8)
/** PIOA_IFDR_P7 Input Filter Disable **/
#define PIOA_IFDR_P7		(1 << 7)
/** PIOA_IFDR_P6 Input Filter Disable **/
#define PIOA_IFDR_P6		(1 << 6)
/** PIOA_IFDR_P5 Input Filter Disable **/
#define PIOA_IFDR_P5		(1 << 5)
/** PIOA_IFDR_P4 Input Filter Disable **/
#define PIOA_IFDR_P4		(1 << 4)
/** PIOA_IFDR_P3 Input Filter Disable **/
#define PIOA_IFDR_P3		(1 << 3)
/** PIOA_IFDR_P2 Input Filter Disable **/
#define PIOA_IFDR_P2		(1 << 2)
/** PIOA_IFDR_P1 Input Filter Disable **/
#define PIOA_IFDR_P1		(1 << 1)
/** PIOA_IFDR_P0 Input Filter Disable **/
#define PIOA_IFDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_ifsr IFSR Glitch Input Filter Status Register
@{*/

/** PIOA_IFSR_P31 Input Filer Status **/
#define PIOA_IFSR_P31		(1 << 31)
/** PIOA_IFSR_P30 Input Filer Status **/
#define PIOA_IFSR_P30		(1 << 30)
/** PIOA_IFSR_P29 Input Filer Status **/
#define PIOA_IFSR_P29		(1 << 29)
/** PIOA_IFSR_P28 Input Filer Status **/
#define PIOA_IFSR_P28		(1 << 28)
/** PIOA_IFSR_P27 Input Filer Status **/
#define PIOA_IFSR_P27		(1 << 27)
/** PIOA_IFSR_P26 Input Filer Status **/
#define PIOA_IFSR_P26		(1 << 26)
/** PIOA_IFSR_P25 Input Filer Status **/
#define PIOA_IFSR_P25		(1 << 25)
/** PIOA_IFSR_P24 Input Filer Status **/
#define PIOA_IFSR_P24		(1 << 24)
/** PIOA_IFSR_P23 Input Filer Status **/
#define PIOA_IFSR_P23		(1 << 23)
/** PIOA_IFSR_P22 Input Filer Status **/
#define PIOA_IFSR_P22		(1 << 22)
/** PIOA_IFSR_P21 Input Filer Status **/
#define PIOA_IFSR_P21		(1 << 21)
/** PIOA_IFSR_P20 Input Filer Status **/
#define PIOA_IFSR_P20		(1 << 20)
/** PIOA_IFSR_P19 Input Filer Status **/
#define PIOA_IFSR_P19		(1 << 19)
/** PIOA_IFSR_P18 Input Filer Status **/
#define PIOA_IFSR_P18		(1 << 18)
/** PIOA_IFSR_P17 Input Filer Status **/
#define PIOA_IFSR_P17		(1 << 17)
/** PIOA_IFSR_P16 Input Filer Status **/
#define PIOA_IFSR_P16		(1 << 16)
/** PIOA_IFSR_P15 Input Filer Status **/
#define PIOA_IFSR_P15		(1 << 15)
/** PIOA_IFSR_P14 Input Filer Status **/
#define PIOA_IFSR_P14		(1 << 14)
/** PIOA_IFSR_P13 Input Filer Status **/
#define PIOA_IFSR_P13		(1 << 13)
/** PIOA_IFSR_P12 Input Filer Status **/
#define PIOA_IFSR_P12		(1 << 12)
/** PIOA_IFSR_P11 Input Filer Status **/
#define PIOA_IFSR_P11		(1 << 11)
/** PIOA_IFSR_P10 Input Filer Status **/
#define PIOA_IFSR_P10		(1 << 10)
/** PIOA_IFSR_P9 Input Filer Status **/
#define PIOA_IFSR_P9		(1 << 9)
/** PIOA_IFSR_P8 Input Filer Status **/
#define PIOA_IFSR_P8		(1 << 8)
/** PIOA_IFSR_P7 Input Filer Status **/
#define PIOA_IFSR_P7		(1 << 7)
/** PIOA_IFSR_P6 Input Filer Status **/
#define PIOA_IFSR_P6		(1 << 6)
/** PIOA_IFSR_P5 Input Filer Status **/
#define PIOA_IFSR_P5		(1 << 5)
/** PIOA_IFSR_P4 Input Filer Status **/
#define PIOA_IFSR_P4		(1 << 4)
/** PIOA_IFSR_P3 Input Filer Status **/
#define PIOA_IFSR_P3		(1 << 3)
/** PIOA_IFSR_P2 Input Filer Status **/
#define PIOA_IFSR_P2		(1 << 2)
/** PIOA_IFSR_P1 Input Filer Status **/
#define PIOA_IFSR_P1		(1 << 1)
/** PIOA_IFSR_P0 Input Filer Status **/
#define PIOA_IFSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_sodr SODR Set Output Data Register
@{*/

/** PIOA_SODR_P31 Set Output Data **/
#define PIOA_SODR_P31		(1 << 31)
/** PIOA_SODR_P30 Set Output Data **/
#define PIOA_SODR_P30		(1 << 30)
/** PIOA_SODR_P29 Set Output Data **/
#define PIOA_SODR_P29		(1 << 29)
/** PIOA_SODR_P28 Set Output Data **/
#define PIOA_SODR_P28		(1 << 28)
/** PIOA_SODR_P27 Set Output Data **/
#define PIOA_SODR_P27		(1 << 27)
/** PIOA_SODR_P26 Set Output Data **/
#define PIOA_SODR_P26		(1 << 26)
/** PIOA_SODR_P25 Set Output Data **/
#define PIOA_SODR_P25		(1 << 25)
/** PIOA_SODR_P24 Set Output Data **/
#define PIOA_SODR_P24		(1 << 24)
/** PIOA_SODR_P23 Set Output Data **/
#define PIOA_SODR_P23		(1 << 23)
/** PIOA_SODR_P22 Set Output Data **/
#define PIOA_SODR_P22		(1 << 22)
/** PIOA_SODR_P21 Set Output Data **/
#define PIOA_SODR_P21		(1 << 21)
/** PIOA_SODR_P20 Set Output Data **/
#define PIOA_SODR_P20		(1 << 20)
/** PIOA_SODR_P19 Set Output Data **/
#define PIOA_SODR_P19		(1 << 19)
/** PIOA_SODR_P18 Set Output Data **/
#define PIOA_SODR_P18		(1 << 18)
/** PIOA_SODR_P17 Set Output Data **/
#define PIOA_SODR_P17		(1 << 17)
/** PIOA_SODR_P16 Set Output Data **/
#define PIOA_SODR_P16		(1 << 16)
/** PIOA_SODR_P15 Set Output Data **/
#define PIOA_SODR_P15		(1 << 15)
/** PIOA_SODR_P14 Set Output Data **/
#define PIOA_SODR_P14		(1 << 14)
/** PIOA_SODR_P13 Set Output Data **/
#define PIOA_SODR_P13		(1 << 13)
/** PIOA_SODR_P12 Set Output Data **/
#define PIOA_SODR_P12		(1 << 12)
/** PIOA_SODR_P11 Set Output Data **/
#define PIOA_SODR_P11		(1 << 11)
/** PIOA_SODR_P10 Set Output Data **/
#define PIOA_SODR_P10		(1 << 10)
/** PIOA_SODR_P9 Set Output Data **/
#define PIOA_SODR_P9		(1 << 9)
/** PIOA_SODR_P8 Set Output Data **/
#define PIOA_SODR_P8		(1 << 8)
/** PIOA_SODR_P7 Set Output Data **/
#define PIOA_SODR_P7		(1 << 7)
/** PIOA_SODR_P6 Set Output Data **/
#define PIOA_SODR_P6		(1 << 6)
/** PIOA_SODR_P5 Set Output Data **/
#define PIOA_SODR_P5		(1 << 5)
/** PIOA_SODR_P4 Set Output Data **/
#define PIOA_SODR_P4		(1 << 4)
/** PIOA_SODR_P3 Set Output Data **/
#define PIOA_SODR_P3		(1 << 3)
/** PIOA_SODR_P2 Set Output Data **/
#define PIOA_SODR_P2		(1 << 2)
/** PIOA_SODR_P1 Set Output Data **/
#define PIOA_SODR_P1		(1 << 1)
/** PIOA_SODR_P0 Set Output Data **/
#define PIOA_SODR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_codr CODR Clear Output Data Register
@{*/

/** PIOA_CODR_P31 Clear Output Data **/
#define PIOA_CODR_P31		(1 << 31)
/** PIOA_CODR_P30 Clear Output Data **/
#define PIOA_CODR_P30		(1 << 30)
/** PIOA_CODR_P29 Clear Output Data **/
#define PIOA_CODR_P29		(1 << 29)
/** PIOA_CODR_P28 Clear Output Data **/
#define PIOA_CODR_P28		(1 << 28)
/** PIOA_CODR_P27 Clear Output Data **/
#define PIOA_CODR_P27		(1 << 27)
/** PIOA_CODR_P26 Clear Output Data **/
#define PIOA_CODR_P26		(1 << 26)
/** PIOA_CODR_P25 Clear Output Data **/
#define PIOA_CODR_P25		(1 << 25)
/** PIOA_CODR_P24 Clear Output Data **/
#define PIOA_CODR_P24		(1 << 24)
/** PIOA_CODR_P23 Clear Output Data **/
#define PIOA_CODR_P23		(1 << 23)
/** PIOA_CODR_P22 Clear Output Data **/
#define PIOA_CODR_P22		(1 << 22)
/** PIOA_CODR_P21 Clear Output Data **/
#define PIOA_CODR_P21		(1 << 21)
/** PIOA_CODR_P20 Clear Output Data **/
#define PIOA_CODR_P20		(1 << 20)
/** PIOA_CODR_P19 Clear Output Data **/
#define PIOA_CODR_P19		(1 << 19)
/** PIOA_CODR_P18 Clear Output Data **/
#define PIOA_CODR_P18		(1 << 18)
/** PIOA_CODR_P17 Clear Output Data **/
#define PIOA_CODR_P17		(1 << 17)
/** PIOA_CODR_P16 Clear Output Data **/
#define PIOA_CODR_P16		(1 << 16)
/** PIOA_CODR_P15 Clear Output Data **/
#define PIOA_CODR_P15		(1 << 15)
/** PIOA_CODR_P14 Clear Output Data **/
#define PIOA_CODR_P14		(1 << 14)
/** PIOA_CODR_P13 Clear Output Data **/
#define PIOA_CODR_P13		(1 << 13)
/** PIOA_CODR_P12 Clear Output Data **/
#define PIOA_CODR_P12		(1 << 12)
/** PIOA_CODR_P11 Clear Output Data **/
#define PIOA_CODR_P11		(1 << 11)
/** PIOA_CODR_P10 Clear Output Data **/
#define PIOA_CODR_P10		(1 << 10)
/** PIOA_CODR_P9 Clear Output Data **/
#define PIOA_CODR_P9		(1 << 9)
/** PIOA_CODR_P8 Clear Output Data **/
#define PIOA_CODR_P8		(1 << 8)
/** PIOA_CODR_P7 Clear Output Data **/
#define PIOA_CODR_P7		(1 << 7)
/** PIOA_CODR_P6 Clear Output Data **/
#define PIOA_CODR_P6		(1 << 6)
/** PIOA_CODR_P5 Clear Output Data **/
#define PIOA_CODR_P5		(1 << 5)
/** PIOA_CODR_P4 Clear Output Data **/
#define PIOA_CODR_P4		(1 << 4)
/** PIOA_CODR_P3 Clear Output Data **/
#define PIOA_CODR_P3		(1 << 3)
/** PIOA_CODR_P2 Clear Output Data **/
#define PIOA_CODR_P2		(1 << 2)
/** PIOA_CODR_P1 Clear Output Data **/
#define PIOA_CODR_P1		(1 << 1)
/** PIOA_CODR_P0 Clear Output Data **/
#define PIOA_CODR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_odsr ODSR Output Data Status Register
@{*/

/** PIOA_ODSR_P31 Output Data Status **/
#define PIOA_ODSR_P31		(1 << 31)
/** PIOA_ODSR_P30 Output Data Status **/
#define PIOA_ODSR_P30		(1 << 30)
/** PIOA_ODSR_P29 Output Data Status **/
#define PIOA_ODSR_P29		(1 << 29)
/** PIOA_ODSR_P28 Output Data Status **/
#define PIOA_ODSR_P28		(1 << 28)
/** PIOA_ODSR_P27 Output Data Status **/
#define PIOA_ODSR_P27		(1 << 27)
/** PIOA_ODSR_P26 Output Data Status **/
#define PIOA_ODSR_P26		(1 << 26)
/** PIOA_ODSR_P25 Output Data Status **/
#define PIOA_ODSR_P25		(1 << 25)
/** PIOA_ODSR_P24 Output Data Status **/
#define PIOA_ODSR_P24		(1 << 24)
/** PIOA_ODSR_P23 Output Data Status **/
#define PIOA_ODSR_P23		(1 << 23)
/** PIOA_ODSR_P22 Output Data Status **/
#define PIOA_ODSR_P22		(1 << 22)
/** PIOA_ODSR_P21 Output Data Status **/
#define PIOA_ODSR_P21		(1 << 21)
/** PIOA_ODSR_P20 Output Data Status **/
#define PIOA_ODSR_P20		(1 << 20)
/** PIOA_ODSR_P19 Output Data Status **/
#define PIOA_ODSR_P19		(1 << 19)
/** PIOA_ODSR_P18 Output Data Status **/
#define PIOA_ODSR_P18		(1 << 18)
/** PIOA_ODSR_P17 Output Data Status **/
#define PIOA_ODSR_P17		(1 << 17)
/** PIOA_ODSR_P16 Output Data Status **/
#define PIOA_ODSR_P16		(1 << 16)
/** PIOA_ODSR_P15 Output Data Status **/
#define PIOA_ODSR_P15		(1 << 15)
/** PIOA_ODSR_P14 Output Data Status **/
#define PIOA_ODSR_P14		(1 << 14)
/** PIOA_ODSR_P13 Output Data Status **/
#define PIOA_ODSR_P13		(1 << 13)
/** PIOA_ODSR_P12 Output Data Status **/
#define PIOA_ODSR_P12		(1 << 12)
/** PIOA_ODSR_P11 Output Data Status **/
#define PIOA_ODSR_P11		(1 << 11)
/** PIOA_ODSR_P10 Output Data Status **/
#define PIOA_ODSR_P10		(1 << 10)
/** PIOA_ODSR_P9 Output Data Status **/
#define PIOA_ODSR_P9		(1 << 9)
/** PIOA_ODSR_P8 Output Data Status **/
#define PIOA_ODSR_P8		(1 << 8)
/** PIOA_ODSR_P7 Output Data Status **/
#define PIOA_ODSR_P7		(1 << 7)
/** PIOA_ODSR_P6 Output Data Status **/
#define PIOA_ODSR_P6		(1 << 6)
/** PIOA_ODSR_P5 Output Data Status **/
#define PIOA_ODSR_P5		(1 << 5)
/** PIOA_ODSR_P4 Output Data Status **/
#define PIOA_ODSR_P4		(1 << 4)
/** PIOA_ODSR_P3 Output Data Status **/
#define PIOA_ODSR_P3		(1 << 3)
/** PIOA_ODSR_P2 Output Data Status **/
#define PIOA_ODSR_P2		(1 << 2)
/** PIOA_ODSR_P1 Output Data Status **/
#define PIOA_ODSR_P1		(1 << 1)
/** PIOA_ODSR_P0 Output Data Status **/
#define PIOA_ODSR_P0		(1 << 0)

/**@}*/

