grevaillot/svd_tools/headers/ATSAM3X8H/pioa.h
/** PIOA_MDER_P31 Multi Drive Enable. **/
#define PIOA_MDER_P31		(1 << 31)
/** PIOA_MDER_P30 Multi Drive Enable. **/
#define PIOA_MDER_P30		(1 << 30)
/** PIOA_MDER_P29 Multi Drive Enable. **/
#define PIOA_MDER_P29		(1 << 29)
/** PIOA_MDER_P28 Multi Drive Enable. **/
#define PIOA_MDER_P28		(1 << 28)
/** PIOA_MDER_P27 Multi Drive Enable. **/
#define PIOA_MDER_P27		(1 << 27)
/** PIOA_MDER_P26 Multi Drive Enable. **/
#define PIOA_MDER_P26		(1 << 26)
/** PIOA_MDER_P25 Multi Drive Enable. **/
#define PIOA_MDER_P25		(1 << 25)
/** PIOA_MDER_P24 Multi Drive Enable. **/
#define PIOA_MDER_P24		(1 << 24)
/** PIOA_MDER_P23 Multi Drive Enable. **/
#define PIOA_MDER_P23		(1 << 23)
/** PIOA_MDER_P22 Multi Drive Enable. **/
#define PIOA_MDER_P22		(1 << 22)
/** PIOA_MDER_P21 Multi Drive Enable. **/
#define PIOA_MDER_P21		(1 << 21)
/** PIOA_MDER_P20 Multi Drive Enable. **/
#define PIOA_MDER_P20		(1 << 20)
/** PIOA_MDER_P19 Multi Drive Enable. **/
#define PIOA_MDER_P19		(1 << 19)
/** PIOA_MDER_P18 Multi Drive Enable. **/
#define PIOA_MDER_P18		(1 << 18)
/** PIOA_MDER_P17 Multi Drive Enable. **/
#define PIOA_MDER_P17		(1 << 17)
/** PIOA_MDER_P16 Multi Drive Enable. **/
#define PIOA_MDER_P16		(1 << 16)
/** PIOA_MDER_P15 Multi Drive Enable. **/
#define PIOA_MDER_P15		(1 << 15)
/** PIOA_MDER_P14 Multi Drive Enable. **/
#define PIOA_MDER_P14		(1 << 14)
/** PIOA_MDER_P13 Multi Drive Enable. **/
#define PIOA_MDER_P13		(1 << 13)
/** PIOA_MDER_P12 Multi Drive Enable. **/
#define PIOA_MDER_P12		(1 << 12)
/** PIOA_MDER_P11 Multi Drive Enable. **/
#define PIOA_MDER_P11		(1 << 11)
/** PIOA_MDER_P10 Multi Drive Enable. **/
#define PIOA_MDER_P10		(1 << 10)
/** PIOA_MDER_P9 Multi Drive Enable. **/
#define PIOA_MDER_P9		(1 << 9)
/** PIOA_MDER_P8 Multi Drive Enable. **/
#define PIOA_MDER_P8		(1 << 8)
/** PIOA_MDER_P7 Multi Drive Enable. **/
#define PIOA_MDER_P7		(1 << 7)
/** PIOA_MDER_P6 Multi Drive Enable. **/
#define PIOA_MDER_P6		(1 << 6)
/** PIOA_MDER_P5 Multi Drive Enable. **/
#define PIOA_MDER_P5		(1 << 5)
/** PIOA_MDER_P4 Multi Drive Enable. **/
#define PIOA_MDER_P4		(1 << 4)
/** PIOA_MDER_P3 Multi Drive Enable. **/
#define PIOA_MDER_P3		(1 << 3)
/** PIOA_MDER_P2 Multi Drive Enable. **/
#define PIOA_MDER_P2		(1 << 2)
/** PIOA_MDER_P1 Multi Drive Enable. **/
#define PIOA_MDER_P1		(1 << 1)
/** PIOA_MDER_P0 Multi Drive Enable. **/
#define PIOA_MDER_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_mddr MDDR Multi-driver Disable Register
@{*/

/** PIOA_MDDR_P31 Multi Drive Disable. **/
#define PIOA_MDDR_P31		(1 << 31)
/** PIOA_MDDR_P30 Multi Drive Disable. **/
#define PIOA_MDDR_P30		(1 << 30)
/** PIOA_MDDR_P29 Multi Drive Disable. **/
#define PIOA_MDDR_P29		(1 << 29)
/** PIOA_MDDR_P28 Multi Drive Disable. **/
#define PIOA_MDDR_P28		(1 << 28)
/** PIOA_MDDR_P27 Multi Drive Disable. **/
#define PIOA_MDDR_P27		(1 << 27)
/** PIOA_MDDR_P26 Multi Drive Disable. **/
#define PIOA_MDDR_P26		(1 << 26)
/** PIOA_MDDR_P25 Multi Drive Disable. **/
#define PIOA_MDDR_P25		(1 << 25)
/** PIOA_MDDR_P24 Multi Drive Disable. **/
#define PIOA_MDDR_P24		(1 << 24)
/** PIOA_MDDR_P23 Multi Drive Disable. **/
#define PIOA_MDDR_P23		(1 << 23)
/** PIOA_MDDR_P22 Multi Drive Disable. **/
#define PIOA_MDDR_P22		(1 << 22)
/** PIOA_MDDR_P21 Multi Drive Disable. **/
#define PIOA_MDDR_P21		(1 << 21)
/** PIOA_MDDR_P20 Multi Drive Disable. **/
#define PIOA_MDDR_P20		(1 << 20)
/** PIOA_MDDR_P19 Multi Drive Disable. **/
#define PIOA_MDDR_P19		(1 << 19)
/** PIOA_MDDR_P18 Multi Drive Disable. **/
#define PIOA_MDDR_P18		(1 << 18)
/** PIOA_MDDR_P17 Multi Drive Disable. **/
#define PIOA_MDDR_P17		(1 << 17)
/** PIOA_MDDR_P16 Multi Drive Disable. **/
#define PIOA_MDDR_P16		(1 << 16)
/** PIOA_MDDR_P15 Multi Drive Disable. **/
#define PIOA_MDDR_P15		(1 << 15)
/** PIOA_MDDR_P14 Multi Drive Disable. **/
#define PIOA_MDDR_P14		(1 << 14)
/** PIOA_MDDR_P13 Multi Drive Disable. **/
#define PIOA_MDDR_P13		(1 << 13)
/** PIOA_MDDR_P12 Multi Drive Disable. **/
#define PIOA_MDDR_P12		(1 << 12)
/** PIOA_MDDR_P11 Multi Drive Disable. **/
#define PIOA_MDDR_P11		(1 << 11)
/** PIOA_MDDR_P10 Multi Drive Disable. **/
#define PIOA_MDDR_P10		(1 << 10)
/** PIOA_MDDR_P9 Multi Drive Disable. **/
#define PIOA_MDDR_P9		(1 << 9)
/** PIOA_MDDR_P8 Multi Drive Disable. **/
#define PIOA_MDDR_P8		(1 << 8)
/** PIOA_MDDR_P7 Multi Drive Disable. **/
#define PIOA_MDDR_P7		(1 << 7)
/** PIOA_MDDR_P6 Multi Drive Disable. **/
#define PIOA_MDDR_P6		(1 << 6)
/** PIOA_MDDR_P5 Multi Drive Disable. **/
#define PIOA_MDDR_P5		(1 << 5)
/** PIOA_MDDR_P4 Multi Drive Disable. **/
#define PIOA_MDDR_P4		(1 << 4)
/** PIOA_MDDR_P3 Multi Drive Disable. **/
#define PIOA_MDDR_P3		(1 << 3)
/** PIOA_MDDR_P2 Multi Drive Disable. **/
#define PIOA_MDDR_P2		(1 << 2)
/** PIOA_MDDR_P1 Multi Drive Disable. **/
#define PIOA_MDDR_P1		(1 << 1)
/** PIOA_MDDR_P0 Multi Drive Disable. **/
#define PIOA_MDDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_mdsr MDSR Multi-driver Status Register
@{*/

/** PIOA_MDSR_P31 Multi Drive Status. **/
#define PIOA_MDSR_P31		(1 << 31)
/** PIOA_MDSR_P30 Multi Drive Status. **/
#define PIOA_MDSR_P30		(1 << 30)
/** PIOA_MDSR_P29 Multi Drive Status. **/
#define PIOA_MDSR_P29		(1 << 29)
/** PIOA_MDSR_P28 Multi Drive Status. **/
#define PIOA_MDSR_P28		(1 << 28)
/** PIOA_MDSR_P27 Multi Drive Status. **/
#define PIOA_MDSR_P27		(1 << 27)
/** PIOA_MDSR_P26 Multi Drive Status. **/
#define PIOA_MDSR_P26		(1 << 26)
/** PIOA_MDSR_P25 Multi Drive Status. **/
#define PIOA_MDSR_P25		(1 << 25)
/** PIOA_MDSR_P24 Multi Drive Status. **/
#define PIOA_MDSR_P24		(1 << 24)
/** PIOA_MDSR_P23 Multi Drive Status. **/
#define PIOA_MDSR_P23		(1 << 23)
/** PIOA_MDSR_P22 Multi Drive Status. **/
#define PIOA_MDSR_P22		(1 << 22)
/** PIOA_MDSR_P21 Multi Drive Status. **/
#define PIOA_MDSR_P21		(1 << 21)
/** PIOA_MDSR_P20 Multi Drive Status. **/
#define PIOA_MDSR_P20		(1 << 20)
/** PIOA_MDSR_P19 Multi Drive Status. **/
#define PIOA_MDSR_P19		(1 << 19)
/** PIOA_MDSR_P18 Multi Drive Status. **/
#define PIOA_MDSR_P18		(1 << 18)
/** PIOA_MDSR_P17 Multi Drive Status. **/
#define PIOA_MDSR_P17		(1 << 17)
/** PIOA_MDSR_P16 Multi Drive Status. **/
#define PIOA_MDSR_P16		(1 << 16)
/** PIOA_MDSR_P15 Multi Drive Status. **/
#define PIOA_MDSR_P15		(1 << 15)
/** PIOA_MDSR_P14 Multi Drive Status. **/
#define PIOA_MDSR_P14		(1 << 14)
/** PIOA_MDSR_P13 Multi Drive Status. **/
#define PIOA_MDSR_P13		(1 << 13)
/** PIOA_MDSR_P12 Multi Drive Status. **/
#define PIOA_MDSR_P12		(1 << 12)
/** PIOA_MDSR_P11 Multi Drive Status. **/
#define PIOA_MDSR_P11		(1 << 11)
/** PIOA_MDSR_P10 Multi Drive Status. **/
#define PIOA_MDSR_P10		(1 << 10)
/** PIOA_MDSR_P9 Multi Drive Status. **/
#define PIOA_MDSR_P9		(1 << 9)
/** PIOA_MDSR_P8 Multi Drive Status. **/
#define PIOA_MDSR_P8		(1 << 8)
/** PIOA_MDSR_P7 Multi Drive Status. **/
#define PIOA_MDSR_P7		(1 << 7)
/** PIOA_MDSR_P6 Multi Drive Status. **/
#define PIOA_MDSR_P6		(1 << 6)
/** PIOA_MDSR_P5 Multi Drive Status. **/
#define PIOA_MDSR_P5		(1 << 5)
/** PIOA_MDSR_P4 Multi Drive Status. **/
#define PIOA_MDSR_P4		(1 << 4)
/** PIOA_MDSR_P3 Multi Drive Status. **/
#define PIOA_MDSR_P3		(1 << 3)
/** PIOA_MDSR_P2 Multi Drive Status. **/
#define PIOA_MDSR_P2		(1 << 2)
/** PIOA_MDSR_P1 Multi Drive Status. **/
#define PIOA_MDSR_P1		(1 << 1)
/** PIOA_MDSR_P0 Multi Drive Status. **/
#define PIOA_MDSR_P0		(1 << 0)

/**@}*/

