grevaillot/svd_tools/headers/ATSAM3X8H/pioa.h
/** PIOA_FRLHSR_P31 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P31		(1 << 31)
/** PIOA_FRLHSR_P30 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P30		(1 << 30)
/** PIOA_FRLHSR_P29 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P29		(1 << 29)
/** PIOA_FRLHSR_P28 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P28		(1 << 28)
/** PIOA_FRLHSR_P27 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P27		(1 << 27)
/** PIOA_FRLHSR_P26 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P26		(1 << 26)
/** PIOA_FRLHSR_P25 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P25		(1 << 25)
/** PIOA_FRLHSR_P24 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P24		(1 << 24)
/** PIOA_FRLHSR_P23 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P23		(1 << 23)
/** PIOA_FRLHSR_P22 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P22		(1 << 22)
/** PIOA_FRLHSR_P21 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P21		(1 << 21)
/** PIOA_FRLHSR_P20 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P20		(1 << 20)
/** PIOA_FRLHSR_P19 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P19		(1 << 19)
/** PIOA_FRLHSR_P18 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P18		(1 << 18)
/** PIOA_FRLHSR_P17 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P17		(1 << 17)
/** PIOA_FRLHSR_P16 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P16		(1 << 16)
/** PIOA_FRLHSR_P15 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P15		(1 << 15)
/** PIOA_FRLHSR_P14 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P14		(1 << 14)
/** PIOA_FRLHSR_P13 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P13		(1 << 13)
/** PIOA_FRLHSR_P12 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P12		(1 << 12)
/** PIOA_FRLHSR_P11 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P11		(1 << 11)
/** PIOA_FRLHSR_P10 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P10		(1 << 10)
/** PIOA_FRLHSR_P9 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P9		(1 << 9)
/** PIOA_FRLHSR_P8 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P8		(1 << 8)
/** PIOA_FRLHSR_P7 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P7		(1 << 7)
/** PIOA_FRLHSR_P6 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P6		(1 << 6)
/** PIOA_FRLHSR_P5 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P5		(1 << 5)
/** PIOA_FRLHSR_P4 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P4		(1 << 4)
/** PIOA_FRLHSR_P3 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P3		(1 << 3)
/** PIOA_FRLHSR_P2 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P2		(1 << 2)
/** PIOA_FRLHSR_P1 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P1		(1 << 1)
/** PIOA_FRLHSR_P0 Edge /Level Interrupt Source Selection. **/
#define PIOA_FRLHSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_locksr LOCKSR Lock Status
@{*/

/** PIOA_LOCKSR_P31 Lock Status. **/
#define PIOA_LOCKSR_P31		(1 << 31)
/** PIOA_LOCKSR_P30 Lock Status. **/
#define PIOA_LOCKSR_P30		(1 << 30)
/** PIOA_LOCKSR_P29 Lock Status. **/
#define PIOA_LOCKSR_P29		(1 << 29)
/** PIOA_LOCKSR_P28 Lock Status. **/
#define PIOA_LOCKSR_P28		(1 << 28)
/** PIOA_LOCKSR_P27 Lock Status. **/
#define PIOA_LOCKSR_P27		(1 << 27)
/** PIOA_LOCKSR_P26 Lock Status. **/
#define PIOA_LOCKSR_P26		(1 << 26)
/** PIOA_LOCKSR_P25 Lock Status. **/
#define PIOA_LOCKSR_P25		(1 << 25)
/** PIOA_LOCKSR_P24 Lock Status. **/
#define PIOA_LOCKSR_P24		(1 << 24)
/** PIOA_LOCKSR_P23 Lock Status. **/
#define PIOA_LOCKSR_P23		(1 << 23)
/** PIOA_LOCKSR_P22 Lock Status. **/
#define PIOA_LOCKSR_P22		(1 << 22)
/** PIOA_LOCKSR_P21 Lock Status. **/
#define PIOA_LOCKSR_P21		(1 << 21)
/** PIOA_LOCKSR_P20 Lock Status. **/
#define PIOA_LOCKSR_P20		(1 << 20)
/** PIOA_LOCKSR_P19 Lock Status. **/
#define PIOA_LOCKSR_P19		(1 << 19)
/** PIOA_LOCKSR_P18 Lock Status. **/
#define PIOA_LOCKSR_P18		(1 << 18)
/** PIOA_LOCKSR_P17 Lock Status. **/
#define PIOA_LOCKSR_P17		(1 << 17)
/** PIOA_LOCKSR_P16 Lock Status. **/
#define PIOA_LOCKSR_P16		(1 << 16)
/** PIOA_LOCKSR_P15 Lock Status. **/
#define PIOA_LOCKSR_P15		(1 << 15)
/** PIOA_LOCKSR_P14 Lock Status. **/
#define PIOA_LOCKSR_P14		(1 << 14)
/** PIOA_LOCKSR_P13 Lock Status. **/
#define PIOA_LOCKSR_P13		(1 << 13)
/** PIOA_LOCKSR_P12 Lock Status. **/
#define PIOA_LOCKSR_P12		(1 << 12)
/** PIOA_LOCKSR_P11 Lock Status. **/
#define PIOA_LOCKSR_P11		(1 << 11)
/** PIOA_LOCKSR_P10 Lock Status. **/
#define PIOA_LOCKSR_P10		(1 << 10)
/** PIOA_LOCKSR_P9 Lock Status. **/
#define PIOA_LOCKSR_P9		(1 << 9)
/** PIOA_LOCKSR_P8 Lock Status. **/
#define PIOA_LOCKSR_P8		(1 << 8)
/** PIOA_LOCKSR_P7 Lock Status. **/
#define PIOA_LOCKSR_P7		(1 << 7)
/** PIOA_LOCKSR_P6 Lock Status. **/
#define PIOA_LOCKSR_P6		(1 << 6)
/** PIOA_LOCKSR_P5 Lock Status. **/
#define PIOA_LOCKSR_P5		(1 << 5)
/** PIOA_LOCKSR_P4 Lock Status. **/
#define PIOA_LOCKSR_P4		(1 << 4)
/** PIOA_LOCKSR_P3 Lock Status. **/
#define PIOA_LOCKSR_P3		(1 << 3)
/** PIOA_LOCKSR_P2 Lock Status. **/
#define PIOA_LOCKSR_P2		(1 << 2)
/** PIOA_LOCKSR_P1 Lock Status. **/
#define PIOA_LOCKSR_P1		(1 << 1)
/** PIOA_LOCKSR_P0 Lock Status. **/
#define PIOA_LOCKSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_wpmr WPMR Write Protect Mode Register
@{*/


#define PIOA_WPMR_WPKEY_SHIFT		8
#define PIOA_WPMR_WPKEY_MASK		0xffffff
/** @defgroup pioa_wpmr_wpkey WPKEY Write Protect KEY
@{*/
/**@}*/

/** PIOA_WPMR_WPEN Write Protect Enable **/
#define PIOA_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup pioa_wpsr WPSR Write Protect Status Register
@{*/


#define PIOA_WPSR_WPVSRC_SHIFT		8
#define PIOA_WPSR_WPVSRC_MASK		0xffff
/** @defgroup pioa_wpsr_wpvsrc WPVSRC Write Protect Violation Source
@{*/
/**@}*/

/** PIOA_WPSR_WPVS Write Protect Violation Status **/
#define PIOA_WPSR_WPVS		(1 << 0)

/**@}*/
